app/controllers/account_controller.rb

SELECT * FROM "users" WHERE (email = 'sudhirsb2003@gmail.com' AND password = '3d058b36859ee2a64d20ae49cddd3343cbcf04b3') LIMIT 1
UPDATE "users" SET "updated_on" = '2013-05-01 13:29:50.087971', "last_logged_in_on" = '2013-05-01 13:29:49.827085' WHERE "id" = 1
---
  def login
    case request.method
      when :post
        begin
          captcha_failed = nil
          if ((@user = User.find_by_email(params[:user][:email])) && @user.requires_captcha?) || params[:recaptcha_challenge_field]
            unless verify_recaptcha
              flash.now[:notice] = 'Captcha verification failed.'
              captcha_failed = true
            end
          end
          unless captcha_failed
          user = User.login(params[:user][:email], params[:user][:password])
          set_current_user(user)
          flash.now[:notice] = "Hi #{current_user.username}, "
          if user.valid?
            flash.now[:notice] << "pick your play right away and start contest2winning!"
          else
            flash.now[:notice] << "your profile seems incomplete. Please <a href='/account/edit_profile'>update your profile</a>."
          end
          if fb_authorized?
            user.update_attribute(:fb_id, session[:facebook_id])