app/controllers/categories_controller.rb

  def show
    @category = Category.find_by_slug(params[:slug])
---
SELECT * FROM "categories" WHERE ("categories"."slug" = 'images') LIMIT 1