app/controllers/community_controller.rb

  def summary
    @community_cache_key = "/community/summary/_time#{params[:time].hash}-#{Time.now.to_i/10.minutes.to_i}" # cache for 10 minutes
    unless read_fragment(@community_cache_key)
      @best_creators = User.top_contest_creators.find(:all, :conditions => ['contests.created_on >= ?', @time], :limit => 8)
      @winners = ShortListedWinner.latest_winners.find(:all, :limit => 5, :conditions => ['short_listed_winners.created_on >= ?', @time])
---
SELECT * FROM "users" WHERE (last_logged_in_on >= now() - interval '1 day') ORDER BY random() LIMIT 12
SELECT * FROM "short_listed_winners" WHERE (short_listed_winners.created_on >= '2013-02-10 15:32:40.822093') AND (accepted = 't') ORDER BY id desc LIMIT 5