app/controllers/crosswords_controller.rb

INSERT INTO "contests" ("user_id", "prize_id", "loyalty_points_enabled", "ends_on", "created_on", "featured", "net_votes", "locked", "campaign_type", "content_type", "starts_on", "username", "status", "category_id", "campaign_id", "login_required", "description", "others_can_submit_entries", "external_url", "title", "type", "updated_on", "played", "stats_updated_on", "brand_url", "version_number", "skin_id", "favourited", "brand_id", "slug") VALUES(1, NULL, NULL, '2020-01-01', '2013-05-01 20:55:17.370705', 'f', 0, 'f', NULL, 'Text', '2013-05-01', 'Sudhir', -1, NULL, NULL, 'f', 'sedfsfsdf', 'f', NULL, 'Test quiz', 'Crossword', '2013-05-01 20:55:17.370705', 0, '1970-01-01 00:00:00.000000', NULL, '2.28', NULL, 0, NULL, 'Test-quiz') RETURNING "id"
---
  def new
    case request.method
    when :post
      @contest = Crossword.new(params[:contest])
      @contest.user_id = current_user.id
      @contest.status = Contest::STATUS_DRAFT
      if @contest.save

SELECT "questions".id FROM "questions" WHERE ("questions".contest_id = 17 AND (questions.status != -1000))
SELECT count(*) AS count_all FROM "questions" WHERE ("questions".contest_id = 17 AND (questions.status != -1000))
SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def add_questions
    unless @contest.questions_editable?(current_user)
      return render(:template => 'shared/access_denied')
    end
    @questions = []
    if request.get?
      if @contest.all_questions.empty?
        10.times {@questions << CrosswordQuestion.new({:answer => ''})}
      else
        @questions = @contest.all_questions
      end
    else
      all_question_ids = @contest.all_question_ids
      errors = false
      params[:questions].each_value { |p_question|
        if all_question_ids.include? p_question[:id].to_i
            question = @contest.all_questions.find(p_question[:id])
            question.attributes = p_question
            question.status = Question::STATUS_DRAFT
            question.save
        else
          question = CrosswordQuestion.new(p_question)
          question.user_id = current_user.id
          question.status = Question::STATUS_DRAFT
          @contest.all_questions << question
        end
        @questions << question
        unless question.errors.empty?