app/controllers/home_controller.rb

SELECT * FROM "contests" WHERE (((contests.featured = 't') AND (starts_on <= now()::date and ends_on >= now()::date)) AND (contests.status = 1)) ORDER BY contests.starts_on desc LIMIT 4 OFFSET 0
---
  def index
    #@title = "Welcome to Contests2win"
    #return render :text => 'Live and kicking...' if request.host == 'localhost' # monit pings
    per_page = 4

    unless request.xhr?
      #@home_contest_cache_key = "/home/_contest#{Time.now.to_i/5.minutes.to_i}" # cache for 5 minutes
      unless read_fragment(@home_contest_cache_key)
        if @question = Question.find_with_image(:first, :conditions => ['contests.featured = true and contests.type != ?', 'Crossword'], :order => 'random()')