app/controllers/prizes_controller.rb

  def browse
    sql = ''
    conditions = []
    conditions[0] = ""
    if params[:id] && PrizeCategory.exists?(params[:id])
      @category = PrizeCategory.find(params[:id])
      conditions[0] << ' id in (select prize_id from prize_categories_prizes where category_id = ?) and '
      conditions << params[:id]
    else
      params[:id] = nil
    end
    conditions[0] << ' credits > 0 and item_type = \'Object\' '

    unless read_fragment(@prizes_browse_key = "#{params.to_s.hash}/#{Time.now.to_i/10.minutes.to_i}")
      @prizes = Prize.available.paginate(:conditions =>  conditions, :page => params[:page], :per_page => 70)
---
SELECT * FROM "prizes" WHERE ( credits > 0 and item_type = 'Object' ) AND (not disabled) ORDER BY title LIMIT 70 OFFSET 0