app/controllers/quizzes_controller.rb

  def new
    case request.method
    when :post
      @contest = Quiz.new(params[:contest])
      @contest.user_id = current_user.id
      @contest.status = Contest::DEFAULT_STATUS
      if @contest.save
---
INSERT INTO "contests" ("user_id", "prize_id", "loyalty_points_enabled", "ends_on", "created_on", "featured", "net_votes", "locked", "campaign_type", "content_type", "starts_on", "username", "status", "category_id", "campaign_id", "login_required", "description", "others_can_submit_entries", "external_url", "title", "type", "updated_on", "played", "stats_updated_on", "brand_url", "version_number", "skin_id", "favourited", "brand_id", "slug") VALUES(1, NULL, NULL, '2020-01-01', '2013-05-01 20:52:55.481269', 'f', 0, 'f', NULL, 'Text', '2013-05-01', 'Sudhir', -1, NULL, NULL, 'f', 'fbgdfbf', 't', NULL, 'Test quiz', 'Quiz', '2013-05-01 20:52:55.481269', 0, '1970-01-01 00:00:00.000000', NULL, '2.28', NULL, 0, NULL, 'Test-quiz') RETURNING "id"